[{"date": "Oct  5, 2009", "score": "5", "text": "I guess the movie it self wasnt all that bad....but boy was i let down after hearing of all the \"great reviews\" this film was given. one review said this was \"On Par with Jaws\" You kidding me!!!!! I was expecting tense scary moments butI guess the movie it self wasnt all that bad....but boy was i let down after hearing of all the \"great reviews\" this film was given. one review said this was \"On Par with Jaws\" You kidding me!!!!! I was expecting tense scary moments but instead all i found my self doing when the monster appeared was casually say \"o i wonder if the thing is going to take someone....\" in the end if you want an okay monster movie to watch go out and rent it. Jaws i felt terrified to swim in the ocean for awhile The Host... well I think ill still brave tubing down rivers without any fear.… Expand"}, {"date": "Aug 20, 2009", "score": "0", "text": "This was the worst movie I have seen in quite some time. Incredibly corny with random attempts to beat the audience about the head with slapstick and physical humor that falls well short of the mark. A CGI monster that is way overrated.This was the worst movie I have seen in quite some time. Incredibly corny with random attempts to beat the audience about the head with slapstick and physical humor that falls well short of the mark. A CGI monster that is way overrated. Ridiculously bad acting and dialogue. Far too long and drawn out with a middle portion that is almost entirely unnecessary. The attempts at politcal statements are paper-thin and blatantly obvious. The critical reception for this movie honestly perplexes me more so than the reception for any other film I thought sucked, even Gladiator.… Expand"}, {"date": "Aug  8, 2009", "score": "8", "text": "This isn't exactly a masterpiece, but it is an entertaining Korean monster flick. This film is certainly not scary, but the monster scenes are rather riveting and cool. The music is fantastic and very well done and fits very well. The This isn't exactly a masterpiece, but it is an entertaining Korean monster flick. This film is certainly not scary, but the monster scenes are rather riveting and cool. The music is fantastic and very well done and fits very well. The film also has a fun sense of humor, even if at times, it is unintentional. This is a very entertaining film that is worthy of owning and enjoying for any fan of monster films. Just remember, when you get it, put the language in Korean, the English voice-overs are terrible and will ruin the film if you watch it like that.… Expand"}, {"date": "Feb 13, 2009", "score": "6", "text": "To put it simply; sickening, overrated, chilling, deathly, yet captivating at the same time. Best monster movie ever? I think not. Good monster movie. Just barely."}, {"date": "May 26, 2008", "score": "0", "text": "This MOvie Sucks MOre Balls Then A Whore I HATED THIS FILM SO FUCKING MUCH IT MADE ME WANT TO PUKE \r\rAFTER I WATCHED 1 HOUR I LOOKED ON THE CASE AND SAW 2 HOURS AND PRETTY MUCH WANTED TO COMIT SUSICIDE BECAUSE I ALREADY HAD ENOUGH FUCKINGThis MOvie Sucks MOre Balls Then A Whore I HATED THIS FILM SO FUCKING MUCH IT MADE ME WANT TO PUKE \r\rAFTER I WATCHED 1 HOUR I LOOKED ON THE CASE AND SAW 2 HOURS AND PRETTY MUCH WANTED TO COMIT SUSICIDE BECAUSE I ALREADY HAD ENOUGH FUCKING SHIT IN MY BRAIN FROM WAYCHING AN HOUR IT AND THIS MOVIE SUCKS SO MUCH IT SHOULD BE TOOK OFF THE SHELVES!!!!!1 REMEMBER THIS ALWAYS\r -YOURS FUCKING TRULY NICK JOES!!!… Expand"}, {"date": "Mar  7, 2008", "score": "9", "text": "If you're looking for a horror movie then you have come to the wrong place. But, this movie is not a horror movie failing to be one. It is something completely different. It is one of the best 'monster movies,' if not the If you're looking for a horror movie then you have come to the wrong place. But, this movie is not a horror movie failing to be one. It is something completely different. It is one of the best 'monster movies,' if not the best, that I have ever seen. It is full of drama and darkish humor. It develops the characters extremely well, even succeeding in giving the monster personality. The struggles that the characters go through are real and do not seem to be fabricated for cinematic effect (besides the monster) and therefore do not leave you with any unanswered questions or loose ends. It is intense, although it is able to calm itself down in times of character development and more intellectual interaction between the characters. It involves much more than the standard Man Vs. Monster theme as seen in so many other movies of its kind. The only gripe I would have with this movie would be the very beginning because it makes it slightly corny. But, nonetheless, you forget about that and any questions of why there is a 50 ft fish going around and eating people are eliminated. The presence of the monster becomes noticeable on a perfect scale as the story progresses. It does an excellent job of showing societal reaction to the monster and makes sure that the magnitude of the public and government reaction is not allowed to go out of control save for maybe some over-the-top government action (but, hey, its Korea). All in all, I'd say that this movie is fast-paced when it needs to be, but also allows itself to have emotional and heartfelt themes.… Expand"}, {"date": "Feb 25, 2008", "score": "5", "text": "The dialog, or lack thereof, pretty much killed this movie for me. With the review it received I was expecting much better. If they took this movie more seriously and left out the idiocy I would have given it an 8!"}, {"date": "Feb  7, 2008", "score": "10", "text": "Used interesting sources. never got bored during whole film. Great!"}, {"date": "Feb  1, 2008", "score": "8", "text": "If you rent this movie, beware that your DVD player doesn't default to play you the dubbed version, as mine did. After sitting through half the movie and wondering how anyone could have enjoyed it, I switched over to the original Korean If you rent this movie, beware that your DVD player doesn't default to play you the dubbed version, as mine did. After sitting through half the movie and wondering how anyone could have enjoyed it, I switched over to the original Korean dialogue with English subtitles. It becomes a different movie, almost literally--and a far superior one. Some of the dialogue is so different between the dubbed and the subtitled English, you can't believe it's coming from the same source. What seems clownish in the dub becomes effective and even stirring when the original dialogue is playing. Whatever you do, don't watch this dubbed; the film's dark humor and queasy tonal shifts make it suffer even worse than most from the process.… Expand"}, {"date": "Jan 29, 2008", "score": "5", "text": "Why do these foreign films have to get a 0 or a 10? The Host is a solid 5 or 6. The family are a sort of Korean version of the family in \"Liitle Miss Sunshine\". A likeable mess that you want to win in the end. The horror takes a big second Why do these foreign films have to get a 0 or a 10? The Host is a solid 5 or 6. The family are a sort of Korean version of the family in \"Liitle Miss Sunshine\". A likeable mess that you want to win in the end. The horror takes a big second place to the comedy. Overall it wasn't a disaster, but it was no masterpiece, either as a thriller or as a relationship piece. As I said, it was a solid 5 or 6/10. Rent it if there's nothing else calling to you at Blockbuster. I'm still trying to work out why so many professional critics pronounced it a masterpiece. It was fine, but nothing worth catching a bus in the rain for.… Expand"}, {"date": "Jan 22, 2008", "score": "10", "text": "Fun, action-filled, humorous film. A must see for those who enjoy Asian films."}, {"date": "Jan 21, 2008", "score": "7", "text": "Let's not get carried away here.. This movie was good for a monster movie. The acting and special effects were mediocre, the movie itself was hardly frightening. I found myself rooting for the monster at times. However, the directing is Let's not get carried away here.. This movie was good for a monster movie. The acting and special effects were mediocre, the movie itself was hardly frightening. I found myself rooting for the monster at times. However, the directing is really a lot of fun and the movie has a point its trying to make, for which it deserves some credit. Not great, not jaws, but certainly one of the better monster flicks. Definitely better than cloverfield.… Expand"}, {"date": "Jan 17, 2008", "score": "1", "text": "Boring! Do not believe the critics. Save your money, rent something else."}, {"date": "Jan 15, 2008", "score": "8", "text": "Well done. A 1 or 0 is way too harsh. Everything worked in this movie, except the most important thing for a monster movie: horror. The movie wasn't scary at all. Not counting that, it was fun, well acted, and an overall well balanced movie."}, {"date": "Jan 14, 2008", "score": "8", "text": "At first I watched it as a monster film, which despite the latest effort by WETA at the time, wasn't that remarkable. But once the realisation kicks in that the actual thing driving the movie is the black humour, you'll begin to At first I watched it as a monster film, which despite the latest effort by WETA at the time, wasn't that remarkable. But once the realisation kicks in that the actual thing driving the movie is the black humour, you'll begin to enjoy it for what it is. Truly successful in constantly breaking your expectations of what's about to happen right to the end. (this includes the protaganist surviving the lobotomy, you sure expected him to come out retarded, didn't you?). Those searching for true comedy/monsters/action movies should go elsewhere, this movie is for those searching for dark humour and something different than the standard Hollywood plotlines.… Expand"}, {"date": "Jan 13, 2008", "score": "0", "text": "Hands down, one of the worst movies I've ever seen, and by far the most critically overrated (\"A masterpiece of monster cinema\"?) After seeing its high ratings on other sites ( I think rotten tomatoes even named it in the top five of Hands down, one of the worst movies I've ever seen, and by far the most critically overrated (\"A masterpiece of monster cinema\"?) After seeing its high ratings on other sites ( I think rotten tomatoes even named it in the top five of the top 100 highest rated sci-fi horror films ever) I rented it anticipating a new masterpiece. terrible, terrible, terrible, I can't stress this enough. In reading through the viewer reviews one might notice the disparity between all 10s or all 0s and 1s. there is a reason (my only guess is that all of the 10s must be Korean culture majors and have never seen a scary movie in their lives). Scary? not in the least, not even remotely suspenseful. Boring? yes! and tedious.. Both my girlfriend and I fell asleep, and thinking we might have missed something good, promptly rewound it (we didn't miss a thing). Funny? unless your'e korean, find slap-stick funny, or know the inside scoop on the subtle complexities of korean humor, NO! The movie's only redeeming moments are the credits, when you realise it is finally over! do not be fooled be fooled by all the great reviews.… Expand"}, {"date": "Dec 18, 2007", "score": "10", "text": "Watch the movie in Korean, with subtitles. Brilliant film. Scary in its own way."}, {"date": "Dec 17, 2007", "score": "10", "text": "One of the best ever in the giant creature subgenre and definitely the best Asian monster movie I have ever seen."}, {"date": "Dec 14, 2007", "score": "4", "text": "The whole movie acts as an insult to film-making. the plot itself is illogical and has stupidity written all over it. i wonder why no critic mentioned the horrible and irrational script this movie is based on. the movie only succeeds in The whole movie acts as an insult to film-making. the plot itself is illogical and has stupidity written all over it. i wonder why no critic mentioned the horrible and irrational script this movie is based on. the movie only succeeds in portraying the Korean government as a irresponsible bunch of people with no idea what so ever as to what they are up against or what they are doing to identify and solve the crisis at hand. the stereotypical portrayal of the american goverment is another thing which only worsens the experience. last but not least the acting is one of the worst i've seen in years.… Expand"}, {"date": "Dec  7, 2007", "score": "10", "text": "Kind of like what would happen if Wes Anderson directed an Asian monster movie. No, it's not scary (when are monster movies ever?). But the monster surprisingly takes a small role, as the family take center stage, and rightly so. Kind of like what would happen if Wes Anderson directed an Asian monster movie. No, it's not scary (when are monster movies ever?). But the monster surprisingly takes a small role, as the family take center stage, and rightly so. It's one of the best disfuncional families I've ever seen. Simply put, it's so much more than just a monster movie. The numerous themes are incredibly relevant (though the whole American ignorance thing might offend some people, even though the guy trying to be a hero and the jerk scientist were hilarious). Monster movies never get respect come award season, but this flick has scored higher than almost all other foreign films, so why not atleast nominate it? It's got more heart and soul than all the shallow oscar bait.… Expand"}, {"date": "Nov 27, 2007", "score": "9", "text": "Excellent, it has many different elements, its a rich movie in acting, argument and production, funny and sad at the same time, I have a really good time watching this movie and will see it again."}, {"date": "Nov 19, 2007", "score": "7", "text": "I don't think the movie nearly met the critical adulation bestowed upon it. While the monster effects were impressive and uniquely designed, the acting was lousy. It's worth renting, just don't expect a masterpiece."}, {"date": "Nov 16, 2007", "score": "9", "text": "Genius. A film for the intelligent; those who don't \"get it\"will still be able to enjoy some laughs here and there."}, {"date": "Oct 14, 2007", "score": "1", "text": "Just a horrible piece of 'film making'. Nothing about this movie worked, from the monster (wasn't scary or engaging in any way), to the humor (I hesitate to call it that, none of it was funny), to the narrative of the Just a horrible piece of 'film making'. Nothing about this movie worked, from the monster (wasn't scary or engaging in any way), to the humor (I hesitate to call it that, none of it was funny), to the narrative of the dysfunctional yet loving family, to the ineptitude of the government's response to a city in crisis. None of it made me the least bit interested in a family running from a beast that looked something like a stegosaurus meets a rhinoceros. Do not see this movie, do not believe the mind boggling positive reviews of the critics... Only a masochist would put himself though the suffering that is work of cinematic drivel.… Expand"}, {"date": "Oct 11, 2007", "score": "2", "text": "The professional critics must be high on something, seeing things which are barely there. What a boring movie.."}, {"date": "Oct  5, 2007", "score": "9", "text": "I recently said to someone that a good creature movie had not been made in a very long time. This movie made me take that back, and then some. Fantastic film."}, {"date": "Sep 18, 2007", "score": "0", "text": "The only reason I don't regret watching this movie is to have been able to read some of the hilarious negative reviews/comments here. Some positive reviews say that you need to have an in depth understanding of Korean culture and even The only reason I don't regret watching this movie is to have been able to read some of the hilarious negative reviews/comments here. Some positive reviews say that you need to have an in depth understanding of Korean culture and even the cliques and classes of their society. Well, what in the hell are the chances that most people are going to know about that? Would you expect us to? Also, some people have said that the problem is the translation. Well that's not our fault, and if that's the case, how could ANYONE seeing it translated enjoy it then? It's going to give me an aneurysm if I think about how many US mainstream critics gave this movie praise. Well, maybe they understood the intricacies of Korean culture better than me.… Expand"}, {"date": "Sep 18, 2007", "score": "3", "text": "Wow, this movie is overrated. Movies that make no sense are not enjoyable. Even fantasy/sci-fi movies must play by their own rules, and this one definitely does not. Why does the monster only eat certain people that are not crucial to the Wow, this movie is overrated. Movies that make no sense are not enjoyable. Even fantasy/sci-fi movies must play by their own rules, and this one definitely does not. Why does the monster only eat certain people that are not crucial to the plot? Why does chemical gas only affect people who are not crucial to the plot? Why is it that a full-frontal lobotomy does absolutely nothing to a person's brain function? (well, you guessed it... he's crucial to the plot.) The creature effects are kinda cool, but the creature doesn't seem to have any definition, we're not really sure about anything about this creature except for that it only eats/kills people half of the time, and it is really quiet (even though it's huge, it can sneak up on people without making a sound). I didn't even mention the terrible translations in the subtitles. \"He's always B-minus, not A-positive! Don't give him a hard time!\" WTH? This movie had some potential, but it's a senseless, frustrating mess with way too many holes. Avoid, avoid, avoid.… Expand"}, {"date": "Sep 16, 2007", "score": "2", "text": "Dear Mr Joon-Ho, I am writing to you in the hope you can give me back the 2hrs of my life I wasted watching your movie. In the event you cannot travel back in time and stop me from watching The Host, please stop making movies. Yours Dear Mr Joon-Ho, I am writing to you in the hope you can give me back the 2hrs of my life I wasted watching your movie. In the event you cannot travel back in time and stop me from watching The Host, please stop making movies. Yours Sincerely James PS. I'd also like my $3.99 back, and a written apology from the Korean government if possible. The Host is perhaps the greatest movie ever made about a monster born from toxic formaldehyde in a Korean river.… Expand"}, {"date": "Sep 12, 2007", "score": "10", "text": "The film directing is so good that subtitles are not needed to follow the storyline. It deserves an Oscar!!!"}, {"date": "Sep  7, 2007", "score": "3", "text": "I don't know how people could like this. I must say I give this movie 3, and thats only for the animated monster. This movie had really bad acting, the story line was so so but the acting was sooo bad. I just laughed the whole time. I I don't know how people could like this. I must say I give this movie 3, and thats only for the animated monster. This movie had really bad acting, the story line was so so but the acting was sooo bad. I just laughed the whole time. I think the one screen that got me just saying what the hell is this, is then they think that girl is dead, so they start crying and hitting each other and falling on the ground. MY GOD, it looked so bad, like little kids not getting what they want. I pity people that watched this in theater.… Expand"}, {"date": "Sep  7, 2007", "score": "2", "text": "What looked like a promising film turned into a boring, dumb story with no suspense or terror. I don't see how this was well reviewed. Bad acting, silly characters....too bad."}, {"date": "Sep  5, 2007", "score": "10", "text": "I can't believe no one understands this movie. The critics scored it high for a reason; this movie needs to be taken seriously for anyone to see the intelligence behind all the slap-stick humor."}, {"date": "Sep  5, 2007", "score": "9", "text": "Whoa, why the bad ratings from the viewers? You have to understand some Korean culture to fully understand this film; a lot of the jokes are dipped with subtle satire, and not a single scene is wasted, all have meanings that build up to the end."}, {"date": "Sep  5, 2007", "score": "6", "text": "A mediocre movie. When I rented this, I was expecting a good horror flick, but it's actually more horror/comedy. There are definitely a few funny moments, but the film keeps switching from light-hearted to serious moments. After a A mediocre movie. When I rented this, I was expecting a good horror flick, but it's actually more horror/comedy. There are definitely a few funny moments, but the film keeps switching from light-hearted to serious moments. After a while, the picture just starts to drag on. Overall, the plot didn't make much sense. I can't rate this entirely as a bad film, since the comedy worked... otherwise, there's not much to see here.… Expand"}, {"date": "Sep  5, 2007", "score": "3", "text": "No way is this so high on metacritic. I was burned into renting this. CGI is low budget!! Painful to watch at times. I eventually fast forwarded to end the misery."}, {"date": "Sep  3, 2007", "score": "0", "text": "This movie just no worth a rental, it`s a waste of time."}, {"date": "Sep  3, 2007", "score": "1", "text": "The worst movie I've ever seen. Some rich kid fresh out of film school. nothing makes sense. one inane scene linked to some stupid ideas. they made the movie just to have the monster do backflips. a waste of time watching it. have your The worst movie I've ever seen. Some rich kid fresh out of film school. nothing makes sense. one inane scene linked to some stupid ideas. they made the movie just to have the monster do backflips. a waste of time watching it. have your fast-forward on your remote ready!… Expand"}, {"date": "Sep  2, 2007", "score": "2", "text": "I agree that the dubbing must have ruined the DVD version. However, I fail to see how this could have been perfect movie even in Korean."}, {"date": "Sep  2, 2007", "score": "0", "text": "I think an investigation should be held into movie critics receiving cash from movie studios for good ratings. This movie makes any of the Godzilla films look like Schindler's List! Some critics have compared this movie to Jaws???!!!! I think an investigation should be held into movie critics receiving cash from movie studios for good ratings. This movie makes any of the Godzilla films look like Schindler's List! Some critics have compared this movie to Jaws???!!!! Do these critics need to give good ratings to international films just to be hip? Is it because they are foreign that the critics seem to kiss their butts???!!! I had respect for the Metacritic score but not anymore. This is a real joke.… Expand"}, {"date": "Sep  2, 2007", "score": "10", "text": "one of the best monster movies i have ever seen. everyone has no idea how great it is. like it has great story and plot and it makes sense. and the somewhat funny parts help the movie it is great."}, {"date": "Aug 31, 2007", "score": "2", "text": "This movie is painful. I do not understand what the critics see in this movie at all."}, {"date": "Aug 31, 2007", "score": "0", "text": "This is an awful film. Please I beg you, for your own sanity, do not watch this."}, {"date": "Aug 31, 2007", "score": "0", "text": "Terrible movie. My husband kept telling me that it got good reviews, so I gave in and watched it. I don't think I have ever seen a \"Horror\" movie that was as lame as this was. A complete waste of about 45 mins. We had to turn it off Terrible movie. My husband kept telling me that it got good reviews, so I gave in and watched it. I don't think I have ever seen a \"Horror\" movie that was as lame as this was. A complete waste of about 45 mins. We had to turn it off because it was just so stupid.… Expand"}, {"date": "Aug 29, 2007", "score": "0", "text": "I'm not sure what movie the critics watched, but I want to see that one. They report seeing biting commentary in a funny monster movie - I saw a movie that bites. I want my 2 hours back."}, {"date": "Aug 29, 2007", "score": "1", "text": "What on earth are the critics doing?!? Watched this movie and it's so bad it isn't even funny-bad!! Am a New Zealander and used to 'cheese' schlock, for example early Peter (Bad Taste, Meet the Feebles) Jackson as well as What on earth are the critics doing?!? Watched this movie and it's so bad it isn't even funny-bad!! Am a New Zealander and used to 'cheese' schlock, for example early Peter (Bad Taste, Meet the Feebles) Jackson as well as other old school badtaste classics-Re-animator, Blood Diner, etc. etc...this is not worth watching period. Tremors a better plot, scares, etc. Maid in Manhattan better plot, scares, etc...are you watching these movies critics?… Expand"}, {"date": "Aug 25, 2007", "score": "4", "text": "I wanted to like it, but it's not a good movie. There was so much undeveloped potential with the plot, character development, satire, climax. The only worthwhile thing I got out of my two hours was a libertarian story, like Katrina & I wanted to like it, but it's not a good movie. There was so much undeveloped potential with the plot, character development, satire, climax. The only worthwhile thing I got out of my two hours was a libertarian story, like Katrina & New Orleans, that demonstrates that the government and its associated bureaucracy is the real monster.… Expand"}, {"date": "Aug 20, 2007", "score": "0", "text": "This is proof that critics have no idea what they are talking about. I couldn't even finish the movie it was so sad. Then The Invasion gets bad reviews, that movie was awesome. Stay away from this movie."}, {"date": "Aug 20, 2007", "score": "5", "text": "A bit of a disappointment. I think that part of the problem was very low quality dubbing. It was probably much better in subtitles"}, {"date": "Aug 20, 2007", "score": "0", "text": "I have been coming to this site for years and have never posted. But after watching this, I had no choice. This movie is not good. I had to talk my wife into watching it and kept telling her how it received great reviews. Once we saw the I have been coming to this site for years and have never posted. But after watching this, I had no choice. This movie is not good. I had to talk my wife into watching it and kept telling her how it received great reviews. Once we saw the monster for the first big scene we could do nothing but laugh. I tried to keep giving it a chance, but finally had to just turn it off. I cannot remember ever turning a movie off that I paid to watch. I'm a big fan of the horror/monster genre, but this was unbearable. DO NOT WASTE YOUR TIME!!!!… Expand"}, {"date": "Aug 13, 2007", "score": "0", "text": "Probably the worst overrated movie of all time."}, {"date": "Aug  9, 2007", "score": "3", "text": "The reviews and acclaim had this on my must see list for quite a while so I admit my expectations were set very high. Unfortunately this film did not even come remotely close. A predictable plot, flat characters, and witless humor ruin what The reviews and acclaim had this on my must see list for quite a while so I admit my expectations were set very high. Unfortunately this film did not even come remotely close. A predictable plot, flat characters, and witless humor ruin what could have been a decent movie. The fact that this movie is billed as \"One of the greatest monster movies of all time\" speaks volumes for the quality of its monster predecessors (no offense Gamora).… Expand"}, {"date": "Aug  3, 2007", "score": "1", "text": "A complete waste of time and money."}, {"date": "Aug  3, 2007", "score": "1", "text": "I want my money back, what a trash movie this was."}, {"date": "Aug  3, 2007", "score": "9", "text": "A great monster movie that is deceptively simple on the surface. To fully appreciate this film, one must not only understand Korean cultural ideals, but also the attitudes of the various cliques and classes of the society. Each of the four A great monster movie that is deceptively simple on the surface. To fully appreciate this film, one must not only understand Korean cultural ideals, but also the attitudes of the various cliques and classes of the society. Each of the four main characters represent familiar archetypes of Korean society. The jokes that seem like mindless slap-stick are often messages of satire. Most of the low ratings people give seem to be based on simplified views of the movie, which is like taking a literal interpretation of 'Alice in Wonderland' or 'Animal Farm.'… Expand"}, {"date": "Jul 31, 2007", "score": "3", "text": "What a disappointment. I read three reviews before seeing this film and they all had nothing but praise for it. I kept thinking, \"When does it start to get good?\" I was never scared during the movie, more often annoyed. Parts were slightly What a disappointment. I read three reviews before seeing this film and they all had nothing but praise for it. I kept thinking, \"When does it start to get good?\" I was never scared during the movie, more often annoyed. Parts were slightly amusing. I thought, \"This must be what passes for Korean humor.\"… Expand"}, {"date": "May 19, 2007", "score": "9", "text": "I must say when I started watching this movie I was unsure as to wether it would be that good. After sitting through the entire movie I can truly say that if your a horror/monster movie fan you will not be disapointed in this movie. The only I must say when I started watching this movie I was unsure as to wether it would be that good. After sitting through the entire movie I can truly say that if your a horror/monster movie fan you will not be disapointed in this movie. The only reason it lost points was that it could have been shorter, cutting out some extended grieving scenes would have made the movie better.… Expand"}, {"date": "Apr 30, 2007", "score": "7", "text": "I liked it. It was good... Great? Umm, I liked the acting, the special effects were very good, and I enjoyed the soft jabs at the good ol' USA. (\"Agent Yellow\" drew a chuckle from the audience I was with.) \"Harsh political commentary?\" I liked it. It was good... Great? Umm, I liked the acting, the special effects were very good, and I enjoyed the soft jabs at the good ol' USA. (\"Agent Yellow\" drew a chuckle from the audience I was with.) \"Harsh political commentary?\" I didn't see that, but I would have welcomed it. \"Defies convention\"? Pretty conventional to me, though nobody is safe in this film, which is refreshing. If this was done by an American studio, with a 'star' headlining, it would have been roundly panned by critics. The principles here were excellent - all fresh faces to me, mixed a bit of humor in well with the 'horror'. Good film! But \"instant classic\"?… Expand"}, {"date": "Apr 24, 2007", "score": "7", "text": "The monster could've been scarier, some of the jokes could've been funnier, and I'll admit there was a lull in the middle of the film when I started glancing at my watch... However, by the end of the movie I genuinely cared The monster could've been scarier, some of the jokes could've been funnier, and I'll admit there was a lull in the middle of the film when I started glancing at my watch... However, by the end of the movie I genuinely cared about the characters and was totally satisfied with the ending. I recommend it. Prepare to feel bad about being an American.… Expand"}, {"date": "Apr 21, 2007", "score": "9", "text": "Absolutely fantastic and original horror film stuffed with harsh political commentary. Would have gotten a 10 had the film not climaxed in the first 20 minutes. I honestly feel bad for those too closed-minded to appreciate the nuances and Absolutely fantastic and original horror film stuffed with harsh political commentary. Would have gotten a 10 had the film not climaxed in the first 20 minutes. I honestly feel bad for those too closed-minded to appreciate the nuances and originality of Asian filmmaking who whine because they went in expecting the same old predictable crap and got something they couldn't instantly wrap their little heads around. See this film with an open mind and forget all of the silly comparisons to \"Jaws\" and \"Alien\"; this film is a true original.… Expand"}, {"date": "Apr 19, 2007", "score": "3", "text": "I could hardly wait to leave the cinema. This is really a terrible motion picture, on virtually every level, from the hokey lizard to the terrible plot to the pathetic dialogue to the overheated, high-school level acting. How on Earth I could hardly wait to leave the cinema. This is really a terrible motion picture, on virtually every level, from the hokey lizard to the terrible plot to the pathetic dialogue to the overheated, high-school level acting. How on Earth it's drawn such high praise is a mystery to me.… Expand"}, {"date": "Apr 19, 2007", "score": "1", "text": "One of the most excrutiatingly boring films I've ever seen. Not a moment of suspense or levity in the entire thing. Don't waste your time with this one!"}, {"date": "Apr 19, 2007", "score": "9", "text": "To those of you nay-sayers out there, the problem of this movie does not lie within the movie itself, but in the translation to English. The humor is completely wasted on ignorant people such as yourselves, who (through no fault of your own) To those of you nay-sayers out there, the problem of this movie does not lie within the movie itself, but in the translation to English. The humor is completely wasted on ignorant people such as yourselves, who (through no fault of your own) have criticized a film you could not understand. Therein lies the failure, the viewer. To those who haven't yet seen this film: give it a shot and build your own solid opinion.… Expand"}, {"date": "Apr 14, 2007", "score": "5", "text": "Are movie critics and the audience who liked this movie just a bunch of elitists out of touch with mainstream audiences, or did I just not get it? Upon viewing \"The Host\" trailer, and with vivid memories of how silly and loveable \"Kung Fu Are movie critics and the audience who liked this movie just a bunch of elitists out of touch with mainstream audiences, or did I just not get it? Upon viewing \"The Host\" trailer, and with vivid memories of how silly and loveable \"Kung Fu Hustle\" was, I became thoroughly excited about the potential for yet another clever and funny Asian movie. Then once I read the movie critics' praises for \"The Host\" I was certain that I was in store for a silly bagful of thrills, laughs, and scares all wrapped up in a thoroughly enjoyable Asian monster movie. Unfortunately the movie does not live up to its billing. To have compared this movie to \"Jaws\", as one critic did, is a total and misleading overreaction. \"The Host\" has a couple of thrilling moments, but it isn't thrilling. It has a few funny moments, but it isn't a funny. And it has a few scary moments, but the it just isn't scary. I'll have to admit that the movie had me on the edge of my seat, but that was only because I was anxious to leave. Perhaps it was the political satire that was so appealing to those that loved this movie. Maybe that's the answer. If you're looking for political satire, then you too may love \"The Host\". However, if you're expecting a truly funny, thrilling, and scary movie, I think you'll be disappointed.… Expand"}, {"date": "Apr  9, 2007", "score": "2", "text": "There's a difference between a 'horror' movie and a 'horrible' movie. The Host falls into the second category. If this is the highest grossing movie in South Korean history, that means the SK film industry is on There's a difference between a 'horror' movie and a 'horrible' movie. The Host falls into the second category. If this is the highest grossing movie in South Korean history, that means the SK film industry is on life-support. If you want to see a good horror movie with plenty of dark humor, rent \"Slither.\"… Expand"}, {"date": "Apr  2, 2007", "score": "8", "text": "This movie is sort of amazing: you get everything a movie can give you in about the first fifteen minutes, and then it manages to be continually engaging after that. Comparisons to Little Miss Sunshine are apt, but The Host is both funnier This movie is sort of amazing: you get everything a movie can give you in about the first fifteen minutes, and then it manages to be continually engaging after that. Comparisons to Little Miss Sunshine are apt, but The Host is both funnier and more true to life. There are a few weak spots, and not a lot that I would actually call \"scary,\" but overall one of the best films I've seen this year or last.… Expand"}, {"date": "Mar 26, 2007", "score": "10", "text": "I usually don't like horror movies. I loved this one. It's scary, but not too bloody. Funny too."}, {"date": "Mar 26, 2007", "score": "9", "text": "Both wonderfully and infuriatingly sloppy as a film, but it has a unique pan-handle quality as The Host dashes from one corridor to the next looking for change. It is a molotov cocktail of horror, science-fiction, family drama, foreign Both wonderfully and infuriatingly sloppy as a film, but it has a unique pan-handle quality as The Host dashes from one corridor to the next looking for change. It is a molotov cocktail of horror, science-fiction, family drama, foreign policy wonk, comedy, and satire. It has moments of pure brilliance as it attacks both government bureaucracies found in the film: Korea and the Occupied Forces of the United States. The film should be most aptly described as a cross between Little Miss Sunshine and Godzilla.… Expand"}, {"date": "Mar 25, 2007", "score": "10", "text": "Not only was this movie hilarious in it's own creepy way, but it made me remember what horror movies were supposed to be about: slimy monsters that made you squirm!"}, {"date": "Mar 24, 2007", "score": "10", "text": "Held my interest from start to finish. Best monster movie I've seen, with good glimpses of modern South Korea, to boot. This is a monster with intelligence and wit."}, {"date": "Mar 19, 2007", "score": "10", "text": "Two days ago I saw \"300\", yesterday I saw \"The Host\"... which one did I like the best? The Host, and judging from the audience reactions... I was not alone. This film breaks all the rules and has fun doing it. It doesn't have the Two days ago I saw \"300\", yesterday I saw \"The Host\"... which one did I like the best? The Host, and judging from the audience reactions... I was not alone. This film breaks all the rules and has fun doing it. It doesn't have the brooding suspensful music, barely lit scenes, buckets of blood and dismemberments of most horror movies and maybe thats why it worked so well. If you don't mind subtitles and you like monster movies ( the old fashioned kind where the monster is not a psycho killer) then GO! You will not be disappointed.… Expand"}]